/*resume.js*/

let userDataUk = ['Воробйова Світлана', 'верстальник сайтів', 'Трускавець | svetlaya87@gmail.com | 380678533259', ''];

let titlesUk = ['Досвід роботи', 'Освіта', 'Курси'];

let myExpUk = [
    ["Фрегат", "Інтернет-провайдер", '2021-2019', 'оператор контакт-центру', 
        "Консультація абонентів по послугах компанії, діагностика работи інтернет-обладнання, кабелю в телефонному режимі."],
    ["ЙогаДень", "Йога марафони в Дніпрі", "2018-2014", "Со-организатор марафону",      "Пошук залу, пошук та запрошення викладачів, створення програми марафону,      ведення сторінки соціальної мережі, створення відео-контенту, печатної продукції та інші организаційні питання."],
    [ "Самозайнятість", "", "2020-2017", "організатор семінарів з йоги та здоров'я",
        "Рішення организаційних питань. Вони майже такі, як і в организації марафону."
        
    ]
];

//"ORT DNIPRO", "Международный образовательный центр, который обучает IT-специальностям"
let addEducUk = [
    [ "Програмування на JavaScript, Frontend", "2021 серпень - травень", "Синтаксис мови JavaScript, работа з елементами дерева, документа, подіями та іншими аспекатми веб-сторінки. Вивчення технології AJAX и робота з  WEB API (REST API). Вивчення та використання на практиці фреймворка Vue.js 3. "],
    ["Основи програмування та веб-розробки: Frontend, JavaScript, HTML, CSS, Bootstrap, GitHub", "2021 квітень - 2020 грудень", "Верстання сторінок (HTML 5.2 & CSS 3). Освоєння технології CSS Grid, адаптивного верстення, Bootstrap 5. Введення, валідація та обробка даних користувача." ], 
    ["QA", "2021 січень - 2020 листопад", "Введення в тестування та аналіз вимог до програмного забезпечення. Методи та види тестування. Тестова документація. Автоматизація тестування."]
]

let EducUk = [
    "Дніпро", "НМетАУ", "2009 липень - 2004 вересень", "Спеціалист", "Облік і аудит"
];


/*main.js */
let worksUk = [
    [
        'https://svetlaya87.github.io/CSS-Grid-homework-10/', 
        'https://github.com/Svetlaya87/CSS-Grid-homework-10',
        "Створити html сторінку згідко малюнку та адаптувати під різні розміри екрану. Інструменті: css grid."
    ],
    [
       'https://svetlaya87.github.io/vue10.2-homework/',
       'https://github.com/Svetlaya87/vue10.2-homework',
       "Написати механізм сортування кнопок 'Name', 'Code' 'Capital' та механізм пошуку для строки 'Search'. Відобразити картинки прапорів країни та її сусідів."
    ],
    [
        'https://svetlaya87.github.io/find-and-sort-goods-9.2/',
        'https://github.com/Svetlaya87/find-and-sort-goods-9.2',
        "Написати механізм сортування кнопок ціни та механізм пошуку для строки 'Search'. Відобразити фотографії товарів."
    ],
    [   'https://svetlaya87.github.io/atm-homework-main/',
        'https://github.com/Svetlaya87/atm-homework-main',
        'Ви маєте дані по заповненню банкомату, котрі завантажуються з файлу the atm-info.json file. Користувач вводить суму, яку бажає зняти. Написати скрипт, який розрахує номінали купюр та їхню кількість, що потрібно надати користувачу. Наприклад, сумма - 3320 грн. Банкомат повинен видати користувачу 500 x 6; 200x1; 100x1; 20x1 банкнот. В той же час, потрібно прагнути до мінімальної кількості виданих банкнот.  Також є ліміт на загальную кількість банкнот, яку банкомат може видати (constant maxNotesLimit).'
    ]
];     

export {userDataUk, titlesUk, myExpUk, addEducUk, EducUk, worksUk};